# Используем официальный образ Python
FROM python:3.10-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Скопируем requirements.txt отдельно перед установкой зависимостей
COPY requirements.txt /app/

# Установим зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Скопируем все остальные файлы проекта в контейнер
COPY . /app

# Указываем порт, который будет использовать приложение
EXPOSE 5000

# Указываем команду для запуска приложения (с параметром host='0.0.0.0', чтобы быть доступным извне контейнера)
CMD ["python", "app.py"]

